nilava/immurok-esp32/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Custom partition table (roomy NVS + 3MB app)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# BLE only (S3 has no BT Classic); Bluedroid with GATTS + SMP for Just Works bonding
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_BLE_SMP_ENABLE=y
CONFIG_BT_GATTS_ENABLE=y

# Logs over the built-in USB-Serial-JTAG (no TinyUSB in this project)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# mbedTLS: ECDH P-256 + HMAC are default-on; keep the cert bundle off (not needed)

# HKDF for immurok shared-key derivation
CONFIG_MBEDTLS_HKDF_C=y

# BLE modem sleep: let the controller power down its radio between connection
# events. Matters more since slave latency went to 0 (the radio now wakes for
# every event instead of skipping up to 29), and recovers most of that cost
# without giving up the link margin that fixed the Windows host.
# Clock source must be the MAIN XTAL: this board has no external 32kHz crystal
# (CONFIG_RTC_CLK_SRC_INT_RC), so selecting EXT_32K_XTAL would break BLE.
CONFIG_BT_CTRL_MODEM_SLEEP=y
CONFIG_BT_CTRL_MODEM_SLEEP_MODE_1=y
CONFIG_BT_CTRL_LPCLK_SEL_MAIN_XTAL=y
